{"id": "c_bdbd01780b3ffae9", "title": "Budgeting and Forecasting (Versions, Spreading, and What-if)", "summary": "# Budgeting and Forecasting (Versions, Spreading, and What-if)\n\n## Budget vs forecast: how to explain it to users\n- **Budget**: the approved plan, often built once per year, sometimes revised.\n- **Forecast**: a periodic re-estimate based on actuals and new assumptions.\n\nIn BI360 planning, users typically select a **Version** (Budget 2026, Forecast Q1, etc.) and enter values by account, cost center, and period.\n\n## Budget versions (why they exist)\nMultiple versions allow:\n- Baseline budget vs working budget\n- Department submissions vs approved final\n- Scenario analysis (base, conservative, aggressive)\n\nSupport tip: when users say \"my numbers disappeared\", confirm they are in the correct version.\n\n## Spreading methods (common patterns)\nUsers often ask: \"How do I spread this across months?\"\n\nTypical spreading behaviors:\n- Even spread across selected periods\n- Based on prior year actual proportions\n- Weighted seasonal curve (front-loaded, back-loaded)\n\nA good help desk answer names the method and the exact period range affected.\n\n## What-if analysis workflow\nA safe what-if workflow avoids overwriting approved numbers:\n1. Copy the baseline version to a new scenario version.\n2. Apply changes in the scenario version only.\n3. Run variance reports comparing scenario vs baseline.\n4. Promote the scenario to approved only after review.\n\n## Driver-based budgeting (common misconception)\nSome users expect \"drivers\" to auto-calculate every line. In many deployments, BI360 supports driver-style templates, but the organization still defines:\n- Which accounts are driver-based\n- Where drivers live (headcount, units, rates)\n- How drivers roll up to accounts\n\nIf these definitions are not configured, users end up doing driver math in Excel.", "tags": ["solver", "bi360", "finance", "budgeting"], "source_path": "sources/solver-finance-mini/budgeting_forecasting.md", "content_hash": "13e7b76114cc6d07bd44025a9611810b4a4b94f4eb00cb6531ec97bef6cea6ce"}
{"id": "c_51850eacf719e5b6", "title": "Common Solver BI360 Support Questions (Finance and IT)", "summary": "# Common Solver BI360 Support Questions (Finance and IT)\n\n## FAQ: Report building and running\n**Q: How do I create a rolling 12-month report?**  \nA: Use an `AsOfPeriod` parameter and define the report period range relative to it (prior 11 periods plus the as-of period). See: Report Designer Basics.\n\n**Q: Why does my report show the wrong period?**  \nA: Most cases are parameter binding issues between Excel or the web filter and the report definition. Verify the parameter names and defaults. See: Report Designer Troubleshooting.\n\n**Q: Why does drill-down show blank?**  \nA: Drill-down depends on transaction-level tables and permissions. Confirm the detail dataset is refreshed and the user role permits detail access. See: Report Designer Troubleshooting.\n\n## FAQ: Data warehouse and refresh\n**Q: Why is my data not refreshing?**  \nA: Check the last successful warehouse job, confirm the schedule is enabled, and verify the user filters match the refreshed period. See: Data Warehouse Connectors and Refresh.\n\n**Q: What is the difference between live and static database?**  \nA: Live queries the ERP directly; static uses a scheduled warehouse refresh. Month-end workflows typically prefer static for stability. See: Data Warehouse Connectors and Refresh.\n\n**Q: How do I connect QuickBooks to the data warehouse?**  \nA: Use a connector profile with credentials and company selection, then run an initial load and validate record counts. Token expiration is a common issue. See: Data Warehouse Connectors and Refresh.\n\n## FAQ: Consolidations and planning\n**Q: How do intercompany eliminations work?**  \nA: Eliminations offset transactions where entity and partner entity differ, posting to an elimination layer while preserving source detail for audit. See: Consolidations and Intercompany.\n\n**Q: What is the difference between budget version and forecast?**  \nA: Budget is the approved plan; forecast is a periodic re-estimate. Versions separate baseline from scenarios. See: Budgeting and Forecasting.\n\n## Out of scope behavior\nIf a question requires an organization-specific policy that is not in this library (for example, \"What is our controller's approval threshold?\"), the correct answer is:  \n\"I cannot answer from this local library. Add your internal policy document to the pack and recompile.\"", "tags": ["solver", "bi360", "finance", "common"], "source_path": "sources/solver-finance-mini/common_questions.md", "content_hash": "76f65874ea743fd065fd4929af57e83043876ad92dada460050d279b9ee4ae3f"}
{"id": "c_6bc2e50ff29b5079", "title": "Consolidations and Intercompany (Entities, Eliminations, and Currency)", "summary": "# Consolidations and Intercompany (Entities, Eliminations, and Currency)\n\n## What consolidation means in BI360 terms\nA consolidated financial statement combines multiple legal entities into one set of financials.\n\nKey inputs:\n- Entity hierarchy (parent, subsidiaries)\n- Ownership percentages\n- Intercompany partner mappings\n- Currency and translation rules\n\n## Multi-entity reporting setup (high level)\n1. Define entity dimension members for each legal entity.\n2. Define a hierarchy that reflects consolidation rollups.\n3. Ensure each transaction record carries an entity identifier.\n4. Validate that the same chart of accounts structure is used consistently.\n\nIf any one of these is missing, consolidated reports either double count or omit entities.\n\n## Intercompany eliminations: what users expect\nFinance users expect eliminations to remove:\n- Intercompany revenue and expense\n- Intercompany AR and AP\n- Intercompany loans and interest\n- Intercompany inventory profit (if tracked)\n\nIn practice, the elimination process relies on a consistent partner field, sometimes called:\n- Intercompany Partner\n- Trading Partner\n- Due To / Due From Entity\n\n## Elimination rule pattern (auditable)\nA safe elimination rule has three parts:\n1. Select transactions where `Entity != PartnerEntity`\n2. Post an offset to an elimination entity (or elimination layer)\n3. Preserve the original transactions for drill-down, but exclude them from consolidated totals after elimination\n\nThis keeps detail auditable while allowing consolidated statements to net to zero for intercompany accounts.\n\n## Currency conversion and translation\nUsers typically see three currencies:\n- Local currency (per entity)\n- Reporting currency (group currency)\n- Transaction currency (for certain source systems)\n\nA common policy:\n- Income statement uses average rate for the period\n- Balance sheet uses ending rate\n- Equity uses historical rates\n\n## Common support questions\n**\"Why do eliminations not net to zero?\"**\n- Partner mapping is missing on one side.\n- Transactions are posted to different periods.\n- Accounts used by one entity are not flagged as intercompany accounts.\n\n**\"Why is one entity missing from the consolidation?\"**\n- Entity is not included in the hierarchy rollup.\n- User security excludes the entity.\n- The warehouse load filtered out that company code.", "tags": ["solver", "bi360", "finance", "consolidations"], "source_path": "sources/solver-finance-mini/consolidations_intercompany.md", "content_hash": "cb8570a26a2ba512ce2aa6e7ddb280ff498262f2b23dbc6e1fdcbd2be97e0017"}
{"id": "c_6a36cbd54b42d7a5", "title": "BI360 Data Warehouse Connectors and Refresh (Live vs Static, Jobs, and Schedules)", "summary": "# BI360 Data Warehouse Connectors and Refresh (Live vs Static, Jobs, and Schedules)\n\n## What the data warehouse is in BI360\nBI360 reporting relies on a curated dataset that usually comes from:\n\n- An ERP connector (Dynamics, NetSuite, QuickBooks, or a custom database)\n- A transformation layer (mapping accounts, entities, and dimensions)\n- A warehouse refresh schedule\n\nUsers experience this as: \"reports pull from the BI360 Data Warehouse.\"\n\n## Connecting an ERP source\n**Typical connector workflow**\n1. Create a connection profile in BI360 (endpoint, credentials, company selection).\n2. Choose which modules to ingest (GL, AP, AR, Projects, Inventory, as applicable).\n3. Map source fields into the BI360 staging tables.\n4. Run an initial load and validate record counts.\n\n**Support signal**\nIf users can sign in but see empty reports, validate the connector ran successfully and mappings exist for their entity.\n\n## Live database vs static database\nFinance users often ask this as: \"Is this real time?\"\n\nA practical way to explain it:\n\n- **Live**: reports query the source database directly. Changes appear immediately, but performance and permissions depend on the ERP.\n- **Static**: BI360 loads data into its warehouse on a schedule. Reports are fast and consistent, but updates appear only after the next refresh.\n\nMost month-end workflows prefer static because it creates a stable snapshot for reconciliation.\n\n## Refresh cadence and what \"not refreshing\" means\nWhen a user says \"my data is not refreshing\", one of three things is usually true:\n\n1. The warehouse job did not run.\n2. The job ran but failed on a source step.\n3. The job completed, but the report is filtered to a different period or scenario.\n\n**Standard checks**\n- Check the last successful refresh timestamp for the dataset.\n- Confirm the scheduled job is enabled and has not been paused.\n- Confirm the user is viewing the intended entity and period.\n\n## Scheduled jobs (what IT typically owns)\nIT teams usually control:\n- Job schedules (hourly, nightly, close-specific)\n- Job sequencing (load, transform, aggregate)\n- Failure notifications\n\n**Close-week recommendation**\n- Increase refresh frequency early in the day.\n- Freeze refreshes during final tie-out windows to avoid moving targets.\n- Communicate the \"data as of\" timestamp to finance users.\n\n## Connector-specific issues (common patterns)\n- **QuickBooks**: authentication tokens expiring, company file selection changes.\n- **Dynamics**: security roles limiting access to certain ledgers or dimensions.\n- **NetSuite**: API throttling during business hours, requiring off-hours loads.\n\nThis demo library treats these as patterns rather than vendor-specific instructions.", "tags": ["solver", "bi360", "finance", "data"], "source_path": "sources/solver-finance-mini/data_warehouse_connectors.md", "content_hash": "e30edd1b9555a7ab32590fea8f67ffad38423cb9f8018e4b9ef134dc7b36bc19"}
{"id": "c_3b31dfafe640ae55", "title": "Month-End Close Workflow (Refresh, Reconcile, Lock, and Variance)", "summary": "# Month-End Close Workflow (Refresh, Reconcile, Lock, and Variance)\n\n## Recommended close sequence (BI360 perspective)\nThis sequence keeps finance users from chasing moving numbers.\n\n1. **Pre-close refresh**: load GL, AP, AR, and subledgers into the warehouse.\n2. **Reconcile totals**: tie BI360 trial balance to the ERP trial balance.\n3. **Post adjustments**: record accruals, reclasses, and eliminations.\n4. **Final refresh**: update warehouse after adjustments.\n5. **Run close package**: financial statements, rollforwards, and variance reports.\n6. **Review and sign-off**: controller review and approvals.\n7. **Lock the period**: prevent further changes for the closed month.\n8. **Distribute reports**: publish to web portal and schedule delivery.\n\n## Period lock: what it should do\nA locked period means:\n- Users cannot write planning entries to that period (if planning is enabled)\n- Reports for that period represent a stable snapshot\n- Any late adjustments require an explicit unlock and audit trail\n\nIn practice, organizations implement this through a combination of:\n- ERP period controls\n- BI360 planning permissions\n- Reporting governance (who can refresh and when)\n\n## Variance analysis workflow (supportable)\nA variance workflow that reduces confusion:\n- Compare Actual vs Budget for the same period.\n- Compare Actual vs Prior Year for the same period.\n- Explain variances using account groups and drill-down to transactions.\n\nIf drill-down does not show transactions, treat it as a warehouse detail access issue or a mapping issue.\n\n## Close-week help desk rules of thumb\n- Publish a daily \"data as of\" timestamp.\n- Keep a short window for refresh changes and communicate it.\n- If the controller signs off, freeze refresh until after reporting distribution.", "tags": ["solver", "bi360", "finance", "month"], "source_path": "sources/solver-finance-mini/month_end_close_workflow.md", "content_hash": "2a39839c12ee540291e28a122e3f1aba033ecf0a4a2aa1f6b88eb2553eec2a80"}
{"id": "c_38ff0e803be669e1", "title": "Report Designer Basics (Excel Add-in and Web Portal)", "summary": "# Report Designer Basics (Excel Add-in and Web Portal)\n\n## What users mean by \"Report Designer\"\nIn Solver BI360, finance teams typically build and run reports in two places:\n\n- **Excel Add-in**: report building and refresh inside Excel. Common for month end workbooks.\n- **Web Portal**: report viewing and distribution through the browser. Often used for scheduled delivery and read-only users.\n\nBoth surfaces point to the same underlying report definitions, but the user experience differs.\n\n## Installing and validating the Excel Add-in\n**Checklist**\n1. Confirm the user is licensed for reporting and can sign in.\n2. Confirm Excel bitness (32-bit vs 64-bit) matches the add-in package installed by IT.\n3. Open Excel, then locate the Solver ribbon and verify it shows the correct environment (prod vs test).\n4. Run a simple report refresh to validate connectivity.\n\n**Support signal**\n- If the ribbon loads but the user cannot sign in, treat it as an authentication or tenant selection issue.\n- If the ribbon does not load, treat it as an add-in registration issue (often Office trust settings).\n\n## Creating a new report and running it\n**Core steps**\n1. Create a new report definition.\n2. Select the data source model (the BI360 Data Warehouse or the configured dataset).\n3. Add rows, columns, and measures using your chart of accounts and dimensions.\n4. Save the report, then run it with a parameter set.\n\n**Common parameter examples**\n- **Period**: 2025-11\n- **Scenario/Version**: Actual, Budget, Forecast\n- **Entity**: Company, Business Unit, Cost Center\n\n## Rolling 12-month report pattern\nA rolling 12-month report requires two parts:\n\n1. A parameter (or internal variable) representing the **as-of period**.\n2. A date range that selects **the prior 11 periods plus the as-of period**.\n\n**Practical setup**\n- Create a parameter called `AsOfPeriod`.\n- Set the column axis to a period range derived from `AsOfPeriod`.\n- If the report output is in Excel, place `AsOfPeriod` in a visible input cell and protect it with data validation.\n\n**Support signal**\nWhen users say \"my rolling report is stuck\", it usually means the `AsOfPeriod` parameter is not being passed from the workbook or the web portal filter.\n\n## Drill-down behavior\nUsers expect drill-down to answer: \"What transactions make up this number?\"\n\nTypical drill-down modes:\n- **Account detail**: expands from a summary account into natural account lines.\n- **Entity detail**: expands from consolidated to entity-level.\n- **Transaction detail**: opens a detail grid based on the underlying fact table.\n\nDrill-down usually depends on:\n- The report cell having a clear dimensional intersection (Account, Entity, Period, Scenario).\n- The data warehouse having a transaction-level table available for that intersection.\n\n## Naming conventions that reduce support tickets\n- Prefix report names by domain: `FIN - Close - Variance`, `FIN - BS - Rollforward`.\n- Put the parameter list into the report description: `Entity, Period, Scenario`.\n- Store shared templates in a controlled folder, not personal workspaces.", "tags": ["solver", "bi360", "finance", "report"], "source_path": "sources/solver-finance-mini/report_designer_basics.md", "content_hash": "49adb5140a87afdbe7ed639d14d8ce4081dd0973df26bee8a1b230260a87e06f"}
{"id": "c_14f8c0f76e6ac004", "title": "Report Designer Troubleshooting (Parameters, Drill-down, and Refresh)", "summary": "# Report Designer Troubleshooting (Parameters, Drill-down, and Refresh)\n\n## First questions to ask on any ticket\n1. Is the user in **Excel Add-in** or **Web Portal**?\n2. Is the issue on **open**, on **refresh**, or only on **drill-down**?\n3. What are the parameter values (Entity, Period, Scenario) at the time of failure?\n4. Does the same report work for another user?\n\nThese four questions usually isolate whether you have a permissions issue, a parameter mapping issue, or a data refresh issue.\n\n## Parameters not applying (the \"wrong period\" problem)\n**Symptoms**\n- The report shows last month even after the user changed the period filter.\n- The report runs, but numbers do not match expectations.\n\n**Likely causes**\n- The workbook cell that should pass the period is not bound to the report parameter.\n- The web portal filter is set, but the report uses a different parameter name.\n- The report definition uses a default parameter value that overrides the UI.\n\n**Fix pattern**\n- Verify the parameter name in the report definition.\n- Verify the workbook or portal passes the same name.\n- Remove conflicting defaults and rely on UI inputs.\n\n## Drill-down shows blank or errors\n**Symptoms**\n- User clicks drill-down and sees an empty list.\n- Drill-down opens but returns \"no data\" even though the summary has a value.\n\n**Likely causes**\n- Security filtering: user can see summary totals but cannot see transaction-level detail.\n- Dimensional mismatch: summary uses mapped accounts, detail table uses natural accounts.\n- The detail table is not refreshed, so it lags behind the summary cube.\n\n**Fix pattern**\n- Confirm the user has access to the transaction detail dataset.\n- Confirm account and entity mappings between summary and detail.\n- Confirm the data warehouse job that populates transaction detail completed.\n\n## Excel Add-in ribbon missing\n**Symptoms**\n- Solver ribbon does not appear after Excel starts.\n\n**Likely causes**\n- Office add-in disabled after a crash.\n- Excel trust center blocked the add-in.\n- Add-in installed for the wrong Office bitness.\n\n**Fix pattern**\n- Check Excel add-ins list and re-enable.\n- Validate the installed package matches Office bitness.\n- If the add-in repeatedly disables, review crash logs and Office updates.\n\n## Refresh fails intermittently\n**Symptoms**\n- Same report refresh works sometimes and fails other times.\n\n**Likely causes**\n- Network path instability (VPN, proxy, SSL inspection).\n- Concurrency limits on the reporting service.\n- Long-running queries timing out when the warehouse is busy.\n\n**Fix pattern**\n- Try the same refresh from a stable network segment.\n- Schedule heavy refreshes outside close hours.\n- Reduce the report scope (fewer entities or fewer periods) and confirm it completes.\n\n## Common support messages and what they usually mean\n- \"I cannot see the company I need\"  \n  Usually a security role or dimension membership issue.\n- \"The numbers do not match the GL\"  \n  Usually the warehouse has not refreshed, or mappings differ between reports.\n- \"The drill-down does not work in Excel but works on the web\"  \n  Usually workbook parameter binding or a local add-in issue.", "tags": ["solver", "bi360", "finance", "report"], "source_path": "sources/solver-finance-mini/report_designer_troubleshooting.md", "content_hash": "a75c7ac511b61f6c242b3f5bd8b13414457e08b7bf28ba9fb1461d5c648767a0"}
